Revit 2024 API
AreaCreationData.TagPoint Property
 Specify the location of the area tag.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public UV TagPoint { get; set; }
Visual Basic
Public Property TagPoint As UV
	Get
	Set
Visual C++
public:
property UV^ TagPoint {
	UV^ get ();
	void set (UV^ value);
}
See Also
AreaCreationData Class
Autodesk.Revit.Creation Namespace